---
type: AssemblyDifferenceMemberDifference
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# AssemblyDifferenceMemberDifference

`Autodesk.Revit.DB.AssemblyDifferenceMemberDifference` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | MemberDifference | 2012 | `public AssemblyMemberDifference MemberDifference { get ; }` |
| Property | MemberId1 | 2012 | `public ElementId MemberId1 { get ; }` |
| Property | MemberId2 | 2012 | `public ElementId MemberId2 { get ; }` |